Repository: onyxcherry/OnyxcherryOTP
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Please log in to access this page.
pl: Zaloguj się, by uzyskać dostęp do tej strony.

source: To protect your account, please reauthenticate to access this page.
pl: Potwierdź swoją tożsamość. To ważne dla bezpieczeństwa konta.

source: [Onyxcherry OTP] Reset Your Password
pl: [Onyxcherry OTP] Zresetuj swoje hasło

source: Username
pl: Nazwa użytkownika

source: Password
pl: Hasło

source: Remember me
pl: Zapamiętaj mnie

source: Sign in
pl: Zaloguj się

source: Repeat Password
pl: Powtórz hasło

source: Register
pl: Zarejestruj się

source: Please use a different username.
pl: Proszę wybrać inną nazwę użytkownika.

source: Please use a different email address.
pl: Proszę użyć innego adresu email.

source: Request password reset
pl: Zresetuj hasło

source: Repeat password
pl: Powtórz hasło

source: Reset my password
pl: Zresetuj moje hasło

source: Submit
pl: Zatwierdź

source: Invalid username or password
pl: Niepoprawna nazwa użytkownika lub hasło

source: Sign In
pl: Zaloguj się

source: Congratulations, you are now a registered user!
pl: Świetnie, jesteś zarejestrowanym użytkownikiem!

source: Check your email for the instructions to reset your password.
pl: Sprawdź skrzynkę obiorczą, by zresetować hasło.

source: Reset Password
pl: Zresetuj hasło

source: Invalid or expired token
pl: Niepoprawny lub nieważny token

source: Your password has been reset.
pl: Twoje hasło zostało zresetowane.

source: Invalid password
pl: Niepoprawne hasło

source: Refresh your session
pl: Odnów swoją sesję

source: Revoked other sessions.
pl: Unieważniono pozostałe sesje.

source: Invalid token!
pl: Niepoprawny token!

source: Home
pl: Strona główna

source: Settings
pl: Ustawienia

source: Welcome to Onyxcherry OTP
pl: Witaj w serwisie Onyxcherry OTP

source: Terms of use.
pl: Warunki użytkowania.

source: Privacy policy
pl: Polityka prywatności

source: Logout
pl: Wyloguj się

source: Hello
pl: Cześć

source: This is my implementation of two-factor authentication app in Flask with required fresh login, revoking other sessions and translations handled by Flask-Babel.
pl: To moja implementacja aplikacji z uwierzytelnianiem dwuskładnikowym opartej na Flasku, wymagającej świeżej sesji do kluczowych operacji, pozwalającej na unieważnienie pozostałych sesji oraz zapewniającej tłumaczenia dzięki Flask-Babel.

source: Get more informations below:
pl: Uzyskaj więcej informacji poniżej:

source: Check source
pl: Sprawdź

source: Choose an authentication method below:
pl: Wybierz metodę uwierzytelnienia poniżej:

source: Backup code
pl: Kody zapasowe

source: Forgot your password?
pl: Zapomniałeś hasła?

source: Click to reset it
pl: Kliknij, by je zresetować

source: New user?
pl: Nowy użytkownik?

source: Click to register!
pl: Kliknij, by się zarejestrować

source: File not found
pl: Nie znaleziono pliku

source: Back
pl: Wróć

source: The administrator has been notified. Sorry for the inconvenience!
pl: Administrator serwisu został powiadomiony. Przepraszamy za niedogodności.

source: Turn off 2FA
pl: Wyłącz 2FA

source: Turn on 2FA
pl: Włącz 2FA

source: Revoke other sessions
pl: Unieważnij pozostałe sesje

source: Deactivated 2FA
pl: Wyłączono 2FA

source: Signing in doesn't require providing 2FA code. Consider turning it on again due to security.
pl: Logowanie nie wymaga już podawanie kodu 2FA. Rozważ włączenie tej opcji ponownie z uwagi na bezpieczeństwo.

source: You are activating two factor authentication.
pl: Aktywujesz uwierzytelnianie dwuskładnikowe.

source: Please keep the secret private.
pl: Nie przekazuj tego kodu innym.

source: Scan the QR and type the code from app below.
pl: Zeskanuj kod QR i przepisz wygenerowany kod.

source: Use an OTP app, e.g. Authy or Google Authenticator.
pl: Użyj aplikacji, np. Authy lub Google Authenticator.

source: Show secret as text
pl: Pokaż jako tekst

source: I understand
pl: Rozumiem

source: Check it
pl: Sprawdź

source: Delete key with credential id
pl: Usunąć klucz z identyfikatorem

source: Insert security key to slot or bring it to the device. Press the gold ring
pl: Włóż klucz bezpieczeństwa do portu lub przyłóż go do urządzenia. Dotknij złotej płytki

source: I inserted
pl: Włożyłem

source: Your keys:
pl: Twoje klucze:

source: Add key
pl: Dodaj klucz

source: I would like to add one
pl: Chciałbym dodać

source: Name registered key
pl: Nazwij zarejestrowany klucz

source: Turn off Webauthn
pl: Wyłącz Webauthn

source: Turn on Webauthn
pl: Włącz Webauthn

source: Manage keys
pl: Zarządzaj kluczami

source: Register new key
pl: Zarejestruj nowy klucz

source: Code:
pl: Kod:

source: An error occured. Please contact the administrator.
pl: Wystąpił błąd. Skontaktuj się z administratorem.

source: Turned on 2FA. You could go to the main page.
pl: Włączono 2FA. Możesz przejść do strony głównej.

source: Invalid OTP code! Try again.
pl: Niepoprawny kod! Spróbuj ponownie.

source: Invalid OTP code
pl: Niepoprawny kod OTP

source: Name:
pl: Nazwa:

source: Correctly!
pl: Udało się!

source: Deleting the key causes deactivating Webauthn for your account!
pl: Usunięcie klucza spowoduje zdezktywowanie Webauthn na Twoim koncie!

source: Deleted!
pl: Usunięto!

source: Enabled Webauthn!
pl: Włączono Webauthn!

source: You have to register keys before
pl: Najpierw zarejestruj klucze!

source: Deactivated webauthn!
pl: Wyłączono Webauthn!

source: Too much keys registered
pl: Zbyt dużo kluczy zarejestrowanych!
